Aero/openFoam/FullAircaft/aircraft/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (-45 0 0);

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform (-45 0 0);
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform (-45 0 0);
    }

    aircraftPatch
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    top
    {
        type            slip;
    }

    bottom
    {
        type            slip;
    }

    frontAndBack
    {
        type            slip;
    }
}

// ************************************************************************* //
