Aero/openFoam/FullAircaft/aircraft/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "2";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.215;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.215;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1.215;
        value           uniform 1.215;
    }

    aircraftPatch
    {
        type            kqRWallFunction;
        value           uniform 1.215;
    } 
     
    top
    {
        type            slip;
    }

    bottom
    {
        type            slip;
    }

    frontAndBack
    {
        type            slip;
    }
}


// ************************************************************************* //
